src/cf/InformationRegisters/СистемыНалогообложенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СистемыНалогообложенияОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяПатент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикТорговыйСбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РозничнаяПродажаАлкоголя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышеннаяСтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяАУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДСПрименяющийУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиУчетаНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаНДС</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрименяетсяОсвобождениеОтУплатыНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОперации0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлассифицироватьНоменклатуруПоОперациям0</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокРегистрацииСчетовФактурНаАванс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалогообложенияПриУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыСтавокНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСтавокНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пониженная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нулевая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пониженная2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяРасчетная2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяУСН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяУСНРасчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПониженнаяУСНРасчетная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/УчетнаяПолитика/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Определяет параметр Период функциональной опции, которая зависит от системы налогообложения.
//
// Параметры:
//   Организация - СправочникСсылка.Организации
//   Период - Дата - Дата, на которую требуется определить настройку системы налогообложения
//   ДатаИзменения - возвращаемое значение даты изменения системы налогообложения
//
// Возвращаемое значение:
//   Дата - Дата, приведенная к началу этого, либо прошлого месяца
//
Функция ПериодНастройкиСистемыНалогообложения(Организация, Период, ДатаИзменения = Неопределено) Экспорт
	
	// Значение Системы налогообложения записывается всегда на первое число месяца, но иногда может измениться
	// в любой день месяца. Поэтому значение Системы нужно брать за этот месяц, если изменения уже вступили в силу,
	// либо за прошлый, если не вступили.

	ЭтотМесяц = НачалоМесяца(Период);
	
	//ДатаИзменения = ПолучитьФункциональнуюОпцию("ДатаИзмененияСистемыНалогообложения",
	//	Новый Структура("Организация, Период", Организация, ЭтотМесяц));
	//
	// Если ДатаИзменения <> Ложь // Значение существует
	//	И (ЭтотМесяц < ДатаИзменения И ДатаИзменения < ДобавитьМесяц(ЭтотМесяц, 1)) // Система НО менялась в течение месяца
	//	И Период < ДатаИзменения Тогда // Значение еще не вступило в силу
	//	Возврат ДобавитьМесяц(ЭтотМесяц, -1); // Прошлый месяц
	//Иначе
	//	Если ДатаИзменения = Ложь Тогда
	//		ДатаИзменения = Дата(1, 1, 1); // Приведение типа
	//	КонецЕсли;
	//	Возврат ЭтотМесяц;
	//КонецЕсли;

	Возврат ЭтотМесяц;

КонецФункции

Функция ПлательщикЕНП(Организация, Период) Экспорт

	Если Период >= Дата(2023, 1, 1) Тогда
		Результат = Истина;
	ИначеЕсли Период < Дата(2022, 7, 1) Тогда
		Результат = Ложь;
	Иначе
		СистемаНалогообложения = РегистрыСведений.СистемыНалогообложенияОрганизаций.ПолучитьПоследнее(КонецДня(Период),
			Новый Структура("Организация", Организация));

		Результат = СистемаНалогообложения.ПлательщикЕНП;
	КонецЕсли;

	Возврат Результат;

КонецФункции 

// Возвращает признак применения системы налогообложения АУСН.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - Организация
//   Период - Дата - Дата, на которую требуется определить настройку системы налогообложения
//
// Возвращаемое значение:
//   Булево - признак применения АУСН
//
Функция ПрименяетсяАУСН(Организация, Период) Экспорт

	СистемаНалогообложения = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(
		Организация, Период);
	Результат = СистемаНалогообложения.ПрименяетсяАУСН;

	Возврат Результат;

КонецФункции

Функция СистемаНалогообложения(Организация, Период, ДатаИзменения = Неопределено) Экспорт

	СистемаНалогообложения = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(
		Организация, Период);

	Возврат СистемаНалогообложения;

КонецФункции

Функция ПрименяетсяТолькоУСНПатент(Организация, Период) Экспорт

	СистемаНалогообложения = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(
		Организация, Период);
	Результат = СистемаНалогообложения.ПлательщикУСН И СистемаНалогообложения.ПрименяетсяПатент;

	Возврат Результат;

КонецФункции

// Определяет, применялся ли УСН выбранной организацией в течение заданного периода
// 
// Параметры:
//  Организация - СправочникСсылка.Организации
//  НачалоПериода - Дата
//  КонецПериода - Дата 
// 
// Возвращаемое значение:
//  - Булево
//
Функция ПрименяетсяУСНЗаПериод(Организация, НачалоПериода, КонецПериода) Экспорт

	МассивЗначений = РегистрыСведений.СистемыНалогообложенияОрганизаций.ЗначенияРесурсаУчетнойПолитикиЗаПериод(
		"ПлательщикУСН", Организация, ПериодНастройкиСистемыНалогообложения(Организация, НачалоПериода),
		ПериодНастройкиСистемыНалогообложения(Организация, КонецПериода));

	Результат = Ложь;
	Для Каждого Значение Из МассивЗначений Цикл
		Результат = Результат Или Значение;
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПрименяетсяОсвобождениеОтУплатыНДС(Организация, Период) Экспорт

	Результат = ПолучитьФункциональнуюОпцию("ПрименяетсяОсвобождениеОтУплатыНДС",
		Новый Структура("Организация, Период", Организация, НачалоМесяца(Период)));

	Возврат Результат;

КонецФункции

// Параметры учетной политики по НДС

Функция ПлательщикНДС(Организация, Период, ДатаИзменения = Неопределено) Экспорт

	СистемаНалогообложения = РегистрыСведений.СистемыНалогообложенияОрганизаций.ПолучитьПоследнее(КонецДня(Период),
		Новый Структура("Организация", Организация));

	Возврат СистемаНалогообложения.ПлательщикНДС;

КонецФункции

Функция Существует(Организация, Период) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|    СистемыНалогообложенияОрганизацийСрезПоследних.Период,
	|    СистемыНалогообложенияОрганизацийСрезПоследних.Организация
	|ИЗ
	|    РегистрСведений.СистемыНалогообложенияОрганизаций.СрезПоследних(&Дата, Организация = &Организация) КАК
	|        СистемыНалогообложенияОрганизацийСрезПоследних";

	Запрос.УстановитьПараметр("Дата", Период);
	Запрос.УстановитьПараметр("Организация", Организация);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

Функция ПлательщикНДСНаУСНСВычетами(Организация, Период, ДатаИзменения = Неопределено) Экспорт

	Возврат ПлательщикНДСПрименяющийУСН(Организация, Период, ДатаИзменения)
		И РегистрыСведений.НастройкиУчетаНДС.СтавкаНалогообложенияПриУСН(Организация, Период)
		= Перечисления.ВидыСтавокНДС.Общая;

КонецФункции

Функция ПлательщикНДСПрименяющийУСН(Организация, Период, ДатаИзменения = Неопределено) Экспорт

	Результат = ПолучитьФункциональнуюОпцию("ПлательщикНДСПрименяющийУСН",
		ПараметрыФункциональнойОпцииНастройкиСистемыНалогообложения(Организация, Период, ДатаИзменения));

	Возврат Результат;

КонецФункции

Функция ПараметрыФункциональнойОпцииНастройкиСистемыНалогообложения(Организация = Неопределено, Период = Неопределено,
	ДатаИзменения = Неопределено)

	ПараметрыФункциональнойОпции = Новый Структура;

	Если Организация <> Неопределено Тогда
		ПараметрыФункциональнойОпции.Вставить("Организация", Организация);
		Если Период <> Неопределено Тогда
			ПараметрыФункциональнойОпции.Вставить("Период", ПериодНастройкиСистемыНалогообложения(Организация, Период,
				ДатаИзменения));
		КонецЕсли;
	КонецЕсли;

	Возврат ПараметрыФункциональнойОпции;

КонецФункции

Функция РаздельныйУчетНДСНаСчете19(Организация, Период) Экспорт
    
    //Раздельный учет не поддерживается в УНФ 
	Возврат Ложь;

КонецФункции

Функция РаздельныйУчетНДС(Организация, Период) Экспорт

    //Раздельный учет не поддерживается в УНФ 
	Возврат Ложь;

КонецФункции

Функция ПорядокРегистрацииСчетовФактурНаАванс(Организация, Период) Экспорт

	Результат = ПолучитьФункциональнуюОпцию("ПорядокРегистрацииСчетовФактурНаАванс",
		Новый Структура("Организация, Период", Организация, НачалоМесяца(Период)));

	Возврат Результат;

КонецФункции

Функция ДатаНачалаУплатыНДСНаУСН(Организация, Период) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаСреза", Период);
	Запрос.УстановитьПараметр("ДатаНачалаПримененияНДСнаУСН", Дата(2025, 1, 1));
	Запрос.Текст =
	"ВЫБРАТЬ
	|    МАКСИМУМ(НастройкиСистемыНалогообложения.Период) КАК Период
	|ПОМЕСТИТЬ ПериодБезНДС
	|ИЗ
	|    РегистрСведений.СистемыНалогообложенияОрганизаций КАК НастройкиСистемыНалогообложения
	|ГДЕ
	|    НастройкиСистемыНалогообложения.Организация = &Организация
	|    И НастройкиСистемыНалогообложения.Период МЕЖДУ &ДатаНачалаПримененияНДСнаУСН И &ДатаСреза
	|    И НЕ НастройкиСистемыНалогообложения.ПлательщикНДСПрименяющийУСН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    МИНИМУМ(НастройкиСистемыНалогообложения.Период) КАК Период
	|ИЗ
	|    РегистрСведений.СистемыНалогообложенияОрганизаций КАК НастройкиСистемыНалогообложения
	|        ЛЕВОЕ СОЕДИНЕНИЕ ПериодБезНДС КАК ПериодБезНДС
	|        ПО НастройкиСистемыНалогообложения.Период > ЕСТЬNULL(ПериодБезНДС.Период, &ДатаНачалаПримененияНДСнаУСН)
	|ГДЕ
	|    НастройкиСистемыНалогообложения.Организация = &Организация
	|    И НастройкиСистемыНалогообложения.Период <= &ДатаСреза
	|    И НастройкиСистемыНалогообложения.ПлательщикНДСПрименяющийУСН";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Период;
	Иначе
		Возврат '00010101';
	КонецЕсли;

КонецФункции

#КонецОбласти
